In [3]:
import pandas as pd

In [4]:
cmp_data = pd.ExcelFile("company_data.xlsx")

cmp_data.sheet_names
cmp_data.parse("Departments")

   dept_id department    location
0        1         HR  Birmingham
1        2         IT   Liverpool
2        3    Finance  Birmingham
3        4  Marketing  Birmingham
4        5      Sales  Birmingham
5        6    Support  Manchester

In [5]:
cmp_sales = pd.ExcelFile("company_sales.xlsx")
cmp_sales.sheet_names

['Sales', 'Customers', 'Orders']

In [21]:
# 1. Show first 5 Employees
# Input Sheet(s): Employees
# Display the first 5 rows of Employees
cmp_data.parse("Employees").loc[:5]

   emp_id   name department  salary joining_date        city
0       1  Emp_1         HR   62855   2015-11-20       Leeds
1       2  Emp_2         HR  118755   2020-08-05  Manchester
2       3  Emp_3  Marketing   93485   2023-04-06  Birmingham
3       4  Emp_4         HR   63274   2024-11-16   Liverpool
4       5  Emp_5    Finance  110565   2022-08-23       Leeds
5       6  Emp_6      Sales   -5000   2019-07-16  Birmingham

In [26]:
# 2. List unique departments
# Input Sheet(s): Employees
# List unique department names
cmp_data.parse("Employees")["department"].unique().tolist()

['HR', 'Marketing', 'Finance', 'Sales', 'Support', 'IT', 'Unknown']

In [44]:
# 3. Count employees per city
# Input Sheet(s): Employees
# Count number of employees grouped by city

cmp_data.parse("Employees").groupby("city")["city"].count()

city
Birmingham    44
Leeds         44
Liverpool     39
London        34
Manchester    39
Name: city, dtype: int64

In [49]:
# 4. Filter employees with salary > 80000
# Input Sheet(s): Employees
# Filter employees with salary > 80000
cmp_df = cmp_data.parse("Employees")
cmp_df.loc[cmp_df["salary"]>80000]

     emp_id     name department  salary joining_date        city
1         2    Emp_2         HR  118755   2020-08-05  Manchester
2         3    Emp_3  Marketing   93485   2023-04-06  Birmingham
4         5    Emp_5    Finance  110565   2022-08-23       Leeds
6         7    Emp_7    Finance  108529   2020-05-04       Leeds
7         8    Emp_8    Support  107661   2015-11-17      London
..      ...      ...        ...     ...          ...         ...
186     187  Emp_187    Finance  110631   2020-10-23      London
187     188  Emp_188         IT   81442   2019-04-11  Manchester
190     191  Emp_191         IT   83042   2023-06-05      London
196     197  Emp_197  Marketing   99709   2016-01-28   Liverpool
198     199  Emp_199      Sales   81020   2022-07-01       Leeds

[88 rows x 6 columns]

In [51]:
# 5. Sort employees by joining_date (latest)
# Input Sheet(s): Employees
# Sort by joining_date desc and show top 12

cmp_data.parse("Employees").sort_values(by="joining_date", ascending=False)

     emp_id     name department  salary joining_date        city
15       16   Emp_16  Marketing   69672   2030-01-01  Manchester
142     143  Emp_143    Finance   38567   2024-12-12   Liverpool
56       57   Emp_57    Support   64190   2024-11-29       Leeds
3         4    Emp_4         HR   63274   2024-11-16   Liverpool
177     178  Emp_178    Finance   98182   2024-11-11  Manchester
..      ...      ...        ...     ...          ...         ...
44       45   Emp_45    Finance   94583   2015-03-11       Leeds
162     163  Emp_163  Marketing   38060   2015-02-14       Leeds
138     139  Emp_139         IT  112390   2015-02-13  Manchester
118     119  Emp_119         IT   83704   2015-01-25  Birmingham
72       73   Emp_73    Support  110215   2015-01-02      London

[200 rows x 6 columns]

In [55]:
# 6. Average salary per department
# Input Sheet(s): Employees
# Calculate average salary per department

cmp_data.parse("Employees").groupby("department")["salary"].mean()

department
Finance      68818.666667
HR           72124.428571
IT           82183.964286
Marketing    84209.133333
Sales        72227.575758
Support      72229.685714
Unknown      92434.000000
Name: salary, dtype: float64

In [64]:
# 7. Employees joined after 2020
# Input Sheet(s): Employees
# Find employees who joined after 2020

cmp_df = cmp_data.parse("Employees")
cmp_dt = pd.to_datetime(cmp_df["joining_date"])
cmp_df.loc[cmp_dt.dt.year>2020]

     emp_id     name department  salary joining_date        city
2         3    Emp_3  Marketing   93485   2023-04-06  Birmingham
3         4    Emp_4         HR   63274   2024-11-16   Liverpool
4         5    Emp_5    Finance  110565   2022-08-23       Leeds
8         9    Emp_9    Finance   91612   2021-06-24  Manchester
11       12   Emp_12         IT   70755   2024-10-31       Leeds
..      ...      ...        ...     ...          ...         ...
185     186  Emp_186    Support   65603   2024-11-06   Liverpool
189     190  Emp_190    Support   79018   2024-05-09   Liverpool
190     191  Emp_191         IT   83042   2023-06-05      London
191     192  Emp_192    Support   68702   2021-11-11  Birmingham
198     199  Emp_199      Sales   81020   2022-07-01       Leeds

[77 rows x 6 columns]

In [ ]:
# 8. Left merge Employees with Departments (sample)
# Input Sheet(s): Employees,Departments
# Left merge Employees with Departments and show sample

cmp_employee = cmp_data.parse("Employees")
cmp_department = cmp_data.parse("Departments")
cmp_employee.merge(cmp_department, how="left", on="department").head(20)

,emp_id,name,department,salary,joining_date,city,dept_id,location
0,1,Emp_1,HR,62855,2015-11-20,Leeds,1.0,Birmingham
1,2,Emp_2,HR,118755,2020-08-05,Manchester,1.0,Birmingham
2,3,Emp_3,Marketing,93485,2023-04-06,Birmingham,4.0,Birmingham
3,4,Emp_4,HR,63274,2024-11-16,Liverpool,1.0,Birmingham
4,5,Emp_5,Finance,110565,2022-08-23,Leeds,3.0,Birmingham
5,6,Emp_6,Sales,-5000,2019-07-16,Birmingham,5.0,Birmingham
6,7,Emp_7,Finance,108529,2020-05-04,Leeds,3.0,Birmingham
7,8,Emp_8,Support,107661,2015-11-17,London,6.0,Manchester
8,9,Emp_9,Finance,91612,2021-06-24,Manchester,3.0,Birmingham
9,10,Emp_10,Finance,34095,2020-06-24,Birmingham,3.0,Birmingham
10,11,Emp_11,Finance,38336,2019-09-17,London,3.0,Birmingham
11,12,Emp_12,IT,70755,2024-10-31,Leeds,2.0,Liverpool
12,13,Emp_13,HR,36327,2022-12-12,Leeds,1.0,Birmingham
13,14,Emp_14,HR,30083,2019-07-30,Liverpool,1.0,Birmingham
14,15,Emp_15,Sales,64346,2020-12-03,Liverpool,5.0,Birmingham
15,16,Emp_16,Marketing,69672,2030-01-01,Manchester,4.0,Birmingham
16,17,Emp_17,Sales,65574,2019-02-09,Manchester,5.0,Birmingham
17,18,Emp_18,Finance,52309,2021-10-04,Leeds,3.0,Birmingham
18,19,Emp_19,HR,31648,2021-10-04,Birmingham,1.0,Birmingham
19,20,Emp_20,Marketing,41984,2015-07-13,Leeds,4.0,Birmingham

In [94]:
# 9. Total revenue per product
# Input Sheet(s): Sales
# Compute total revenue per product

cmp_sales.parse("Sales").groupby("product", as_index=False)["price_per_unit"].aggregate(["sum"])

      product    sum
0        Dock  18641
1  Headphones  24157
2    Keyboard  27187
3      Laptop  29597
4     Monitor  40410
5       Mouse  27795
6     Printer  30188

In [93]:
# 10. Top employees by revenue
# Input Sheet(s): Sales
# Rank employees by total sales revenue
cmp_sales.parse("Sales").groupby("emp_id")["price_per_unit"].agg(["sum"])

         sum
emp_id
4       1594
5       2658
9       1754
11      4812
12      2665
...      ...
196     2082
197     2409
199     3270
200     1618
9999     489

[132 rows x 1 columns]

In [ ]:
# 11. Identify negative salaries
# Input Sheet(s): Employees
# Find employees with negative salary values

cmp_df = cmp_data.parse("Employees")

cmp_df.loc[cmp_df["salary"]<0]

   emp_id   name department  salary joining_date        city
5       6  Emp_6      Sales   -5000   2019-07-16  Birmingham

In [109]:
# 12. Departments with missing locations
# Input Sheet(s): Departments
# Find departments with missing location

cmp_df = cmp_data.parse("Departments")
cmp_df.loc[(cmp_df["location"].isna()) | (cmp_df["location"] == "")]

Empty DataFrame
Columns: [dept_id, department, location]
Index: []

In [114]:
# 13. Offices referencing invalid emp_id
# Input Sheet(s): Offices
# List offices where emp_id not present in Employees


cmp_office_df = cmp_data.parse("Offices")
cmp_employee_df = cmp_data.parse("Employees")
cmp_office_df.loc[~cmp_office_df["emp_id"].isin(cmp_employee_df["emp_id"])]

Empty DataFrame
Columns: [office_id, emp_id, office_name, floor]
Index: []

In [118]:
# 14. Sales with non-positive quantity or price
# Input Sheet(s): Sales
# Find sales with quantity <=0 or price_per_unit <=0

cmp_df = cmp_sales.parse("Sales")
cmp_df.loc[(cmp_df["quantity"]<=0) | (cmp_df["price_per_unit"]<=0)]

   sale_id  emp_id     product  quantity  price_per_unit  sale_date
3        4      88  Headphones        -5             406 2020-04-18
7        8      33  Headphones         9               0 2022-04-02

In [134]:
# 15. Customers with duplicate names
# Input Sheet(s): Customers
# Identify customers that have duplicate names

cmp_df = cmp_sales.parse("Customers")
cmp_df.loc[cmp_df["name"].duplicated(keep=False)]

Empty DataFrame
Columns: [customer_id, name, city, registration_date]
Index: []

In [139]:
# 16. Orders referencing invalid sale_id
# Input Sheet(s): Orders
# Find orders with sale_id not present in Sales

cmp_order_df = cmp_sales.parse("Orders")
cmp_sales_df = cmp_sales.parse("Sales")

cmp_order_df.loc[~cmp_order_df["sale_id"].isin(cmp_sales_df["sale_id"])]

Empty DataFrame
Columns: [order_id, sale_id, customer_id, order_date, status]
Index: []

In [ ]:
# 17. Monthly sales quantity trend (sample)
# Input Sheet(s): Sales
# Show monthly quantity sums (sample tail)
cmp_sales_df = cmp_sales.parse("Sales")
cmp_sales_df["sale_date"] = pd.to_datetime(cmp_sales_df["sale_date"])
cmp_sales_df.groupby(cmp_sales_df["sale_date"].dt.to_period("M"))["quantity"].sum().tail()

sale_date
2023-10    102
2023-11     14
2023-12     75
2024-01     32
2024-02     10
Freq: M, Name: quantity, dtype: int64

In [161]:
# 18. Top products by quantity
# Input Sheet(s): Sales
# Show top products by quantity sold

cmp_sales_df = cmp_sales.parse("Sales").groupby("product")["quantity"].sum().head(10)
cmp_sales_df

product
Dock          245
Headphones    214
Keyboard      260
Laptop        290
Monitor       436
Mouse         256
Printer       348
Name: quantity, dtype: int64

In [172]:
# 19. Sales left-join with employee names (sample)
# Input Sheet(s): Sales,Employees
# Left join Sales with Employees to include employee names

cmp_sales_df = cmp_sales.parse("Sales")
cmp_employee_df = cmp_data.parse("Employees")

pd.merge(cmp_sales_df, cmp_employee_df[["emp_id", "name"]], on="emp_id", how="left")

     sale_id  emp_id     product  quantity  price_per_unit  sale_date     name
0          1      80        Dock        14             502 2023-03-02   Emp_80
1          2     190     Monitor         9            1363 2021-08-08  Emp_190
2          3     197     Printer         5             766 2023-01-09  Emp_197
3          4      88  Headphones        -5             406 2020-04-18   Emp_88
4          5     112     Printer        15             797 2023-08-29  Emp_112
..       ...     ...         ...       ...             ...        ...      ...
195      196     164      Laptop         1             715 2020-04-30  Emp_164
196      197      67     Printer        13            1811 2021-08-06   Emp_67
197      198      66       Mouse        18              14 2023-09-25   Emp_66
198      199      83       Mouse        12             399 2023-07-07   Emp_83
199      200     100     Printer        11             608 2024-01-18  Emp_100

[200 rows x 7 columns]

In [ ]:
# 20. Revenue per customer (top sample)
# Input Sheet(s): Orders,Sales
# Compute total revenue per customer (top 12)

cmp_sales.sheet_names

order = cmp_sales.parse("Orders")
sales = cmp_sales.parse("Sales")
sales
sales

sales["revenue"] = sales["quantity"] * sales["price_per_unit"]

result = pd.merge(order[["customer_id", "sale_id"]], sales[["revenue", "sale_id"]], on="sale_id")
result.groupby(["customer_id"], as_index=False)["revenue"].sum().sort_values("revenue", ascending=False).head(12)

     customer_id  revenue
73           115    52936
90           138    49541
85           132    45622
34            58    45287
19            28    41098
44            70    39616
6             10    39211
30            46    39002
38            62    36439
112          169    33243
87           134    32444
33            56    31952

In [70]:
# 21. Q21: Pivot - product vs month quantity (sample)
# Input Sheet(s): Sales
# Create pivot table product vs month (sample)

sales = cmp_sales.parse("Sales")
sales["sale_date"] = pd.to_datetime(sales["sale_date"])

pivot_df = pd.pivot_table(sales, index="product", columns=sales["sale_date"].dt.to_period("M"), values="quantity", aggfunc="sum", fill_value=0)

pivot_df.sample(5)

sale_date,2020-01,2020-02,2020-03,2020-04,2020-05,2020-06,2020-07,2020-08,2020-09,2020-10,...,2023-05,2023-06,2023-07,2023-08,2023-09,2023-10,2023-11,2023-12,2024-01,2024-02
product,,,,,,,,,,,,,,,,,,,,,
Headphones,4,14,0,-5,0,37,0,0,0,14,...,0,5,0,0,0,0,0,4,3,0
Monitor,0,26,0,18,11,10,16,0,0,19,...,19,19,0,15,0,21,3,11,0,0
Mouse,19,2,13,0,3,2,0,0,0,19,...,20,16,26,15,18,29,0,0,0,0
Printer,0,0,0,0,0,0,14,0,0,17,...,0,10,0,15,0,52,0,33,11,0
Keyboard,0,4,31,0,0,10,20,0,15,0,...,0,0,0,32,0,0,0,0,1,0

In [77]:
# 22. Q22: Detect duplicate sales rows
# Input Sheet(s): Sales
# Find duplicated sales rows


sales = cmp_sales.parse("Sales")
sales[sales.duplicated(keep=False)]

Empty DataFrame
Columns: [sale_id, emp_id, product, quantity, price_per_unit, sale_date]
Index: []

In [87]:
# Q23: Replace negative salaries with NaN
# Input Sheet(s): Employees
# Replace negative salary values with NaN and show affected rows

employee_salary = cmp_data.parse("Employees")
# employee_salary.loc[employee_salary["salary"].apply(employee_salary["salary"].replace(None))]

employee_salary.loc[employee_salary["salary"] < 0, "salary"] = pd.NA

employee_salary[employee_salary["salary"].isna()]

   emp_id   name department  salary joining_date        city
5       6  Emp_6      Sales     NaN   2019-07-16  Birmingham